# 1. تعريف المتغيرات
game = "كرة القدم"
players = 11

# 2. طباعة المتغيرات
print("اسم اللعبة:", game)
print("عدد اللاعبين:", players)

# النتيجة (المخرجات):
# اسم اللعبة: كرة القدم
# عدد اللاعبين: 11



game = "كرة القدم"
players = 11

print(f"عدد لاعبين {game} هو {players} لاعباً")

# النتيجة: عدد لاعبين كرة القدم هو 11 لاعباً


# حلقة تكرار عكسية
for i in range(2, -1, -1):
    print("العدد", i)

# النتيجة المخرجة:
# العدد 2
# العدد 1
# العدد 0


# كود التكرار لطباعة تسلسل أرقام
for i in range(3):

   print(i) 

# المخرجات (النتيجة):
# 0
# 1
# 2


# إنشاء قائمة والوصول للعنصر الأول
my_list = ["عصير", "قهوة", "شاي"]

print(my_list[0])

# النتيجة المخرجة:
# شاي


